perf/load_testing/results/ping_results

> perf@1.0.0 artillery
> artillery run load_testing/ping.yaml -e app

Phase started: WarmUp (index: 0, duration: 30s) 14:57:48(-0300)

--------------------------------------
Metrics for period to: 14:57:50(-0300) (width: 0.029s)
--------------------------------------

http.codes.200: ................................................................ 5
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 3
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 5
vusers.completed: .............................................................. 5
vusers.created: ................................................................ 5
vusers.created_by_name.Ping (/ping): ........................................... 5
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 24.3
  max: ......................................................................... 29.2
  median: ...................................................................... 25.3
  p95: ......................................................................... 28.5
  p99: ......................................................................... 28.5


--------------------------------------
Metrics for period to: 14:58:00(-0300) (width: 9.006s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.1
  max: ......................................................................... 7.2
  median: ...................................................................... 4
  p95: ......................................................................... 5.5
  p99: ......................................................................... 7.2


Phase completed: WarmUp (index: 0, duration: 30s) 14:58:18(-0300)

Phase started: Ramp (index: 1, duration: 30s) 14:58:18(-0300)

--------------------------------------
Metrics for period to: 14:58:10(-0300) (width: 9.004s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 3
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 4.7
  median: ...................................................................... 3.8
  p95: ......................................................................... 4.3
  p99: ......................................................................... 4.6


--------------------------------------
Metrics for period to: 14:58:20(-0300) (width: 9.024s)
--------------------------------------

http.codes.200: ................................................................ 56
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 56
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 3
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 56
vusers.completed: .............................................................. 56
vusers.created: ................................................................ 56
vusers.created_by_name.Ping (/ping): ........................................... 56
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 22.7
  median: ...................................................................... 3.9
  p95: ......................................................................... 21.5
  p99: ......................................................................... 21.5


--------------------------------------
Metrics for period to: 14:58:30(-0300) (width: 9.506s)
--------------------------------------

http.codes.200: ................................................................ 116
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 116
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 116
vusers.completed: .............................................................. 116
vusers.created: ................................................................ 116
vusers.created_by_name.Ping (/ping): ........................................... 116
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2
  max: ......................................................................... 20.3
  median: ...................................................................... 3.8
  p95: ......................................................................... 8.1
  p99: ......................................................................... 8.9


Phase completed: Ramp (index: 1, duration: 30s) 14:58:49(-0300)

Phase started: Plain (index: 2, duration: 60s) 14:58:49(-0300)

--------------------------------------
Metrics for period to: 14:58:40(-0300) (width: 9.509s)
--------------------------------------

http.codes.200: ................................................................ 168
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 168
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 12
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 10.1
http.responses: ................................................................ 168
vusers.completed: .............................................................. 168
vusers.created: ................................................................ 168
vusers.created_by_name.Ping (/ping): ........................................... 168
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 18.5
  median: ...................................................................... 4.7
  p95: ......................................................................... 9.3
  p99: ......................................................................... 16.6


--------------------------------------
Metrics for period to: 14:58:50(-0300) (width: 9.007s)
--------------------------------------

http.codes.200: ................................................................ 189
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 189
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 5
http.responses: ................................................................ 189
vusers.completed: .............................................................. 189
vusers.created: ................................................................ 189
vusers.created_by_name.Ping (/ping): ........................................... 189
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 8.6
  median: ...................................................................... 4.5
  p95: ......................................................................... 6.5
  p99: ......................................................................... 7.5


--------------------------------------
Metrics for period to: 14:59:00(-0300) (width: 9.507s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 9
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 18
  median: ...................................................................... 5.2
  p95: ......................................................................... 9.9
  p99: ......................................................................... 16.3


--------------------------------------
Metrics for period to: 14:59:10(-0300) (width: 9.509s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 5
  median: ...................................................................... 3
  p95: ......................................................................... 4
  p99: ......................................................................... 5
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.2
  max: ......................................................................... 9.7
  median: ...................................................................... 4.9
  p95: ......................................................................... 7.2
  p99: ......................................................................... 8.1


--------------------------------------
Metrics for period to: 14:59:20(-0300) (width: 9.509s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 7
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 6
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 10.6
  median: ...................................................................... 5
  p95: ......................................................................... 7.2
  p99: ......................................................................... 8.4


--------------------------------------
Metrics for period to: 14:59:30(-0300) (width: 9.508s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 7
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 6
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.6
  max: ......................................................................... 11
  median: ...................................................................... 5.2
  p95: ......................................................................... 7.8
  p99: ......................................................................... 9.3


Phase completed: Plain (index: 2, duration: 60s) 14:59:49(-0300)

Phase started: CoolDown (index: 3, duration: 30s) 14:59:49(-0300)

--------------------------------------
Metrics for period to: 14:59:40(-0300) (width: 9.509s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 7
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 6
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.5
  max: ......................................................................... 9.9
  median: ...................................................................... 5.4
  p95: ......................................................................... 8.4
  p99: ......................................................................... 9.7


--------------------------------------
Metrics for period to: 14:59:50(-0300) (width: 9.509s)
--------------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 20/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 6
http.responses: ................................................................ 200
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.Ping (/ping): ........................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.1
  max: ......................................................................... 9.3
  median: ...................................................................... 5.1
  p95: ......................................................................... 7.5
  p99: ......................................................................... 8.8


--------------------------------------
Metrics for period to: 15:00:00(-0300) (width: 9.005s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 8.6
  median: ...................................................................... 3.1
  p95: ......................................................................... 6.5
  p99: ......................................................................... 7.9


Phase completed: CoolDown (index: 3, duration: 30s) 15:00:19(-0300)

--------------------------------------
Metrics for period to: 15:00:10(-0300) (width: 9.005s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 4
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 6.4
  median: ...................................................................... 3.2
  p95: ......................................................................... 4.7
  p99: ......................................................................... 5.8


--------------------------------------
Metrics for period to: 15:00:20(-0300) (width: 9.005s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 3
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 7
  median: ...................................................................... 3.2
  p95: ......................................................................... 5.3
  p99: ......................................................................... 6.5


All VUs finished. Total time: 2 minutes, 33 seconds

--------------------------------
Summary report @ 15:00:20(-0300)
--------------------------------

http.codes.200: ................................................................ 1128
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 1128
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 12
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 6
http.responses: ................................................................ 1128
vusers.completed: .............................................................. 1128
vusers.created: ................................................................ 1128
vusers.created_by_name.Ping (/ping): ........................................... 1128
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2
  max: ......................................................................... 29.2
  median: ...................................................................... 4.6
  p95: ......................................................................... 7.5
  p99: ......................................................................... 10.5